using System;

class TheoreticalTasksForChapter1
{
    static void Main()
    {
        Console.WriteLine("Задача 2: Представлява стандартните входове, изходи и потоци за грешки за конзолните приложения." +
        " Този клас не може да бъде наследен. ");
        Console.WriteLine("Задача 3: Записва определените данни, последвани от терминатора на текущата линия," +
        " до стандартния изходен поток.");
        Console.WriteLine("Задача 12: C# е обектно-ориентиран език създадена от Microsoft в нея  има платформа .NET , която улеснява работата с езика." +
        "NET Framework е оригиналната .NET имплементация за Windows," +
        "която е развивана от Microsoft като проект със затворен код повече от десетилетие." +
        "Използва се при разработката на конзолни приложения,Windows UI(desktop) приложения, уеб приложения, cloud системи имного други." +
        "NET Core е по-новата версия на .NET платформата, която е .NETимплементация с отворен код," +
        " поддържана официално за Windows,Linux и macOS.");
        Console.WriteLine("Задача 13: Други известни езици за програмиране са C++,Java,Python,Html,Pascal. Различават се по синтаксиса.");
    }
}


